{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "31579dd5-078e-4338-9124-cfe181fc7547",
   "metadata": {},
   "source": [
    "# Домашнее задание «Типы данных и циклы. Часть 1»"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cf480404-8195-4aa0-9731-d49cccc7d192",
   "metadata": {},
   "source": [
    "## Задача 1\n",
    "\n",
    "Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:\n",
    "- среднюю букву, если число букв в слове нечетное;\n",
    "- две средних буквы, если число букв четное.\n",
    "\n",
    "### Примеры работы программы:\n",
    "\n",
    "1. word = 'test’ **Результат**: es\n",
    "\n",
    "2. word = 'testing’ **Результат**: t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "489b14de-2df7-4cfe-9d98-49991fb82f8a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "t\n"
     ]
    }
   ],
   "source": [
    "word = 'testing'\n",
    "length = len(word)\n",
    "middle = length // 2\n",
    "\n",
    "if length % 2 == 1:\n",
    "    print(word[middle])\n",
    "else:\n",
    "    print(word[middle-1:middle+1])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "35b93f00-7711-44de-883b-efb18e0d5aee",
   "metadata": {},
   "source": [
    "## Задача 2\n",
    "\n",
    "Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.\n",
    "\n",
    "### Примеры работы программы: \n",
    "\n",
    "1. Введите число: 1\n",
    "Введите число: 4\n",
    "Введите число: 6\n",
    "Введите число: 0\n",
    "\n",
    "**Результат**: 11\n",
    "\n",
    "2. Введите число: 0\n",
    "\n",
    "**Результат**: 0"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "87a6474f-f982-4286-975e-5275d067653b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "Введите число:  5\n",
      "Введите число:  5\n",
      "Введите число:  5\n",
      "Введите число:  5\n",
      "Введите число:  5\n",
      "Введите число:  0\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Сумма: 25\n"
     ]
    }
   ],
   "source": [
    "summ = 0\n",
    "\n",
    "while True:\n",
    "    n = int(input('Введите число: '))\n",
    "    summ += n\n",
    "    if n == 0: break\n",
    "\n",
    "print('Сумма:', summ)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ac36147b-a35a-416e-99ff-f2fbf230a5b2",
   "metadata": {},
   "source": [
    "## Задание 3\n",
    "\n",
    "Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.\n",
    "Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары\n",
    "\n",
    "| Пример 1 | Пример 2 |\n",
    "|----------|----------|\n",
    "| `boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']` | `boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']` |\n",
    "| `girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']` | `girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']` |\n",
    "| **Вывод:**<br>Идеальные пары:<br>Alex и Emma<br>Arthur и Kate<br>John и Kira<br>Peter и Liza<br>Richard и Trisha | **Вывод:**<br>Внимание, кто-то может остаться без пары!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d30edbcc-57b7-4b3d-9c3c-779e4c4c7a18",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Внимание, кто-то может остаться без пары!\n"
     ]
    }
   ],
   "source": [
    "boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard', 'Michael']\n",
    "girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']\n",
    "\n",
    "boys.sort()\n",
    "girls.sort()\n",
    "\n",
    "if len(boys) != len(girls):\n",
    "    print('Внимание, кто-то может остаться без пары!')\n",
    "else:\n",
    "    print('Идеальные пары:')\n",
    "    for i in range(len(boys)):\n",
    "        print(f'{boys[i]} и {girls[i]}')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a73aea29-bda4-41d4-ad86-259c88d60a49",
   "metadata": {},
   "source": [
    "## Задача 4\n",
    "\n",
    "У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях для каждой страны.\n",
    "\n",
    "Формула: `°C = (°F - 32) * 5/9`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "2a62b74d-266c-489c-99a3-13c26e5037eb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Средняя температура в странах:\n",
      "Таиланд - 23.9 С\n",
      "Германия - 13.8 С\n",
      "Россия - 3.7 С\n",
      "Польша - 12.0 С\n"
     ]
    }
   ],
   "source": [
    "countries_temperature = [\n",
    "    ['Таиланд', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],\n",
    "    ['Германия', [57.2, 55.4, 59, 59, 53.6]],\n",
    "    ['Россия', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],\n",
    "    ['Польша', [50, 50, 53.6, 57.2, 55.4, 55.4]]\n",
    "]\n",
    "\n",
    "print('Средняя температура в странах:')\n",
    "\n",
    "for country in countries_temperature:\n",
    "    avg_f = sum(country[1]) / len(country[1])\n",
    "    avg_c = (avg_f - 32) * 5 / 9\n",
    "    print(f'{country[0]} - {avg_c:.1f} С')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "221ee324-7c0b-4ff9-8cc2-2c6d486c4d62",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
