{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "48c2ec34-33de-476a-b386-a7b986d66fb7",
   "metadata": {},
   "source": [
    "# Домашнее задание к лекции «Типы данных и циклы. Часть 2»"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b3fa5c59-0e58-4436-968a-7921845ea7a2",
   "metadata": {},
   "source": [
    "## Задача 1\n",
    "\n",
    "Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество уникальных гео-меток всех пользователей.\n",
    "\n",
    "### Пример работы программы:\n",
    "\n",
    "`ids = {‘user1’: [213, 213, 213, 15, 213],  ‘user2’: [54, 54, 119, 119, 119],  ‘user3’: [213, 98, 98, 35]}`\n",
    "\n",
    "**Результат**: `{98, 35, 15, 213, 54, 119}`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "413f6401-b5cf-4086-8672-013bc8e6285b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{98, 35, 15, 213, 54, 119}\n"
     ]
    }
   ],
   "source": [
    "ids = {\n",
    "    'user1': [213, 213, 213, 15, 213],\n",
    "    'user2': [54, 54, 119, 119, 119],\n",
    "    'user3': [213, 98, 98, 35]\n",
    "}\n",
    "\n",
    "uniq_geo = set()\n",
    "\n",
    "for user in ids:\n",
    "    for geo in ids[user]:\n",
    "        uniq_geo.add(geo)\n",
    "\n",
    "print(unique_geo)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "049f272b-5278-409a-9c5e-2a9c2e97c4d5",
   "metadata": {},
   "source": [
    "## Задача 2\n",
    "\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже, но запросы потенциально могут быть любые). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n",
    "\n",
    "### Пример работы программы:\n",
    "\n",
    "queries = [‘смотреть сериалы онлайн’, ‘новости спорта’, ‘афиша кино’, ‘курс доллара’, ‘сериалы этим летом’, ‘курс по питону’, ‘сериалы про спорт’]\n",
    "\n",
    "**Результат**:  \n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%  \n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "df1a0726-8af8-442e-8a99-c9792db9d1bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 2 слов(а): 14.29%\n",
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n",
      "Поисковых запросов, содержащих 1 слов(а): 14.29%\n",
      "Поисковых запросов, содержащих 4 слов(а): 14.29%\n"
     ]
    }
   ],
   "source": [
    "queries = [\n",
    "    'милые котята',\n",
    "    'картинки котиков смотреть',\n",
    "    'кот',\n",
    "    'кот и банан мем',\n",
    "    'сериалы этим летом',\n",
    "    'курс по питону',\n",
    "    'сериалы про спорт'\n",
    "]\n",
    "\n",
    "total_queries = len(queries)\n",
    "word_count = {}\n",
    "\n",
    "for q in queries:\n",
    "    num_words = len(q.split(' '))\n",
    "    word_count[num_words] = word_count.get(num_words, 0) + 1\n",
    "\n",
    "for num_words, count in word_count.items():\n",
    "    percent = (count / total_queries) * 100\n",
    "    print(f'Поисковых запросов, содержащих {num_words} слов(а): {percent:.2f}%')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aa0ddb7d-c18b-492d-9c45-de80cda2dd07",
   "metadata": {},
   "source": [
    "## Задача 3\n",
    "Дана переменная, в которой хранится информация о затратах и доходе рекламных кампаний по различным источникам. Необходимо дополнить исходную структуру показателем ROI, который рассчитаем по формуле: `((revenue / cost) - 1) * 100`\n",
    "\n",
    "### Пример работы программы:\n",
    "\n",
    "results = {  \n",
    "‘vk’: {‘revenue’: 103, ‘cost’: 98},  \n",
    "‘yandex’: {‘revenue’: 179, ‘cost’: 153},  \n",
    "‘facebook’: {‘revenue’: 103, ‘cost’: 110},  \n",
    "‘adwords’: {‘revenue’: 35, ‘cost’: 34},  \n",
    "‘twitter’: {‘revenue’: 11, ‘cost’: 24},  \n",
    "}\n",
    "\n",
    "**Результат:**  \n",
    "{  \n",
    "‘adwords’: {‘revenue’: 35, ‘cost’: 34, ‘ROI’: 2.94},  \n",
    "‘facebook’: {‘revenue’: 103, ‘cost’: 110, ‘ROI’: -6.36},  \n",
    "‘twitter’: {‘revenue’: 11, ‘cost’: 24, ‘ROI’: -54.17},  \n",
    "‘vk’: {‘revenue’: 103, ‘cost’: 98, ‘ROI’: 5.1},  \n",
    "‘yandex’: {‘revenue’: 179, ‘cost’: 153, ‘ROI’: 16.99}  \n",
    "}  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "0261d361-4ca8-4c80-add4-d750616866fd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'vk': {'revenue': 103, 'cost': 98, 'ROI': 5.1}, 'yandex': {'revenue': 179, 'cost': 153, 'ROI': 16.99}, 'facebook': {'revenue': 103, 'cost': 110, 'ROI': -6.36}, 'adwords': {'revenue': 35, 'cost': 34, 'ROI': 2.94}, 'twitter': {'revenue': 11, 'cost': 24, 'ROI': -54.17}}\n"
     ]
    }
   ],
   "source": [
    "results = {\n",
    "    'vk': {'revenue': 103, 'cost': 98},\n",
    "    'yandex': {'revenue': 179, 'cost': 153},\n",
    "    'facebook': {'revenue': 103, 'cost': 110},\n",
    "    'adwords': {'revenue': 35, 'cost': 34},\n",
    "    'twitter': {'revenue': 11, 'cost': 24},\n",
    "}\n",
    "\n",
    "for source, data in results.items():\n",
    "    roi = ((data['revenue'] / data['cost']) - 1) * 100\n",
    "    data['ROI'] = round(roi, 2)\n",
    "\n",
    "print(results)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "44803c5b-efdf-426b-af07-cf95ad68c318",
   "metadata": {},
   "source": [
    "## Задача 4\n",
    "\n",
    "Дана переменная, в которой хранится статистика рекламных каналов по объемам продаж (пример структуры данных приведен ниже). Напишите программу, которая возвращает название канала с максимальным объемом продаж.\n",
    "\n",
    "### Пример работы программы:\n",
    "\n",
    "`stats = {‘facebook’: 55, ‘yandex’: 115, ‘vk’: 120, ‘google’: 99, ‘email’: 42, ‘ok’: 98}`\n",
    "\n",
    "**Результат:** Максимальный объем продаж на рекламном канале: vk"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "c2f36f6b-faf0-4e7e-8c68-405557f60b0c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Максимальный объем продаж на рекламном канале: yandex\n"
     ]
    }
   ],
   "source": [
    "stats = {'facebook': 55, 'yandex': 121, 'vk': 120, 'google': 99, 'email': 42, 'ok': 98}\n",
    "\n",
    "max_channel = ''\n",
    "max_value = 0\n",
    "\n",
    "for channel in stats:\n",
    "    if stats[channel] > max_value:\n",
    "        max_value = stats[channel]\n",
    "        max_channel = channel\n",
    "\n",
    "print(f'Максимальный объем продаж на рекламном канале: {max_channel}')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
